<template>
	<view class="agreement-root" :style="{ paddingTop: statusBarHeight + 40 + 'px' }">
		<common-title :isBack="true" bgColor="#000000">
			<template v-slot:default>
				用户协议
			</template>
		</common-title>
		<view class="container">
			<view class="con1">
				<h2>用户服务协议</h2>
				<view style="text-align:center">（ 生效时间 2021 年 08 月 31 日）</view>
				<view>
					欢迎您使用“Space Universe
					Coins”APP（以下简称SUC），。为了给您提供更好的服务，在您使用“SUC”服务前，请用户仔细阅读本协议，如用户不同意本协议或其中任何条款约定，用户应立即停止注册。
				</view>
				<view>
					我们将按照本协议的有关条款为用户提供网络服务。当
					<b>您点击同意《“SUC”用户服务协议》</b>
					即表示您同意并接受本协议的全部内容，愿意遵守本协议及“SUC”平台公示的各项规则、规范的全部内容，若您不同意则可停止注册、登录或使用“SUC”平台的相关服务。
				</view>
			</view>
			<view class="con2">
				<h2>第一部分 定义</h2>
				<view>
					1.“SUC”服务：“SUC”服务APP上展示并提供的各种功能服务，具体服务内容以您下载使用的版本为准。
				</view>
				<view>
					2.“SUC”服务规则：“SUC”网站内已经发布及后续发布的全部规则、解读、公告等内容以及“SUC”APP、活动页面等发布的各类规则、实施细则、产品说明、公告等。
				</view>
				<h2>第二部分 账户注册、管理和个人数据保护</h2>
				<view><b>1、账号的类型：</b></view>
				<view>
					注册账号：您可以使用归属于您本人的手机号进行注册，获得注册账号。用户通过账号登录，可在“SUC”进行相关的活动。
				</view>
				<view>
					您在注册“SUC”时应具备中华人民共和国法律法规规定的与您的行为相适应的民事行为能力，能够依据法律规定和本协议约定独立承担相应的法律责任。
				</view>
				<view>您应该使用真实有效的信息注册“SUC”。</view>
				<view class="underline">
					您了解并同意，您有义务保持您提供信息的真实性及有效性，不得以虚假、冒用的居民身份信息、企业注册信息、组织机构代码等注册信息进行注册或认证，任何非法、不真实、不准确的用户信息所产生的责任由您自行承担。您所设置的账号名不得违反国家法律法规及平台规则关于账号名的管理规定，否则“SUC”有权对您的账号名进行屏蔽、暂停使用或注销等处理，并向主管机关报告。
				</view>
				<view class="underline">
					您同意并授权，为了更好的为您提供服务以及确保您的账号安全，SUC可以根据您提供的手机号码、身份证号码等信息，向全国公民身份号码查询服务中心、电信运营商、金融服务机构等可靠单位发起用户身份真实性、用户征信记录、用户手机号码有效性状态等情况的查询。
				</view>
				<view><b>2.账户属性与管理</b></view>
				<view>
					“SUC”账户一经注册，只限您本人使用，不得出借、赠与、出租、转让、售卖或分享他人使用。在您获得账号后，请您遵守本协议的各项条款，妥善管理好自己的账号及密码。如您发现自己的账号或密码被他人非法使用或其他异常的情况时，请及时修改密码。
					<b class="underline">
						因用户未妥善保管其帐号名称及密码而导致的任何损失，由用户自行承担，“SUC”不承担任何责任。
					</b>
				</view>
				<view>
					为了更好地提供服务和帮助、保护用户合法权益，在申请注册时所您提供的信息须是真实、准确、合法、有效的，并注意及时更新，以免在使用过程中受到限制或无法使用。
					<b class="underline">
						如因您未及时更新有关信息并通知“SUC”，您应自行承担全部责任及由此导致的损失。
					</b>
				</view>
			</view>
			<view class="con3">
				<h2>第三部分 玩法说明</h2>
				<view>
					1.太空币（Space Universe
					Coin）简称SUC，为公司自主研发产品，之后会不断研发各种玩法及活动，保障SUC的创新。
				</view>
				<view>2.玩家注册后，登录实名即可赠送一台木星矿机，享受矿机收益。</view>
				<view>
					3.玩家享受推广三代矿机收益奖励（1代：5%，2代：3%，3代：1%），注意：下级需复投或者购买一次矿机才可享受下级所有矿机收益提成。
				</view>
			</view>
			<view class="con3">
				<h2>第四部分 信息的授权和收集</h2>
				<view>
					为了提供更好的服务，“SUC”将会收集您的一些信息或数据，您注册“SUC”账号时，代表同意界面中的《用户服务协议》或使用“SUC”服务即表明您已经同意并授权“SUC”对您的部分信息进行收集。
				</view>
				<view>
					我们将建立健全“SUC”用户信息安全管理制度，按照法律相关规定保障用户信息安全。除用户同意、隐私保护声明约定以及法律法规规定外，不会向其他任何公司、组织或个人披露您的个人信息。对于“SUC”会如何收集、使用、存储和保护您的个人信息及其他内容。
				</view>
				<view>
					<b class="underline">
						用户在使用“SUC”账号和登录“SUC”平台过程中，禁止以搜集、复制、存储、传播等任何方式使用其他用户的个人信息，否则，由此产生的后果需用户自行承担。
					</b>
				</view>
			</view>

			<view class="con3">
				<h2>第五部分 账户冻结</h2>
				<view>请您理解并同意“SUC”在以下情形将冻结您的账户，并对此不承担任何责任：</view>
				<view>
					（1）用户存在信息盗用，恶意扰乱市场，多次订单超时未付等行为，我们将冻结您的账号”。
				</view>
				<view>（2）用户违反法律法规、本协议约定，“SUC”将冻结您的账户。</view>
				<view>
					冻结账户后，您将无法登录“SUC”或使用已冻结的账户，
					<b>账户中的资产也会被冻结。</b>
				</view>
			</view>
			<view class="con3">
				<h2>第六部分 知识产权</h2>
				<view>
					“SUC”的一切知识产权（包括不限于版权、商标权、专利权、商业秘密）以及相关的所有信息内容（包括但不限于界面设计、版面框架、数据资料、文字、图片、图形、图表、音频、视频、软件等）除第三方授权的软件或技术外，均属于“SUC”所有，并受中华人民共和国法律法规和相应的国际条约保护。“SUC”享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。
				</view>
				<view>
					未经我们或相关权利人书面同意，用户不得为任何营利性或非营利性的目的自行实施、利用、转让或许可任何三方实施、利用、转让上述知识产权，我们保留追究上述未经许可行为的权利。
				</view>
			</view>
			<view class="con3">
				<h2>第七部分 权利与义务</h2>
				<view>1.用户的权利及义务</view>
				<view>
					您可以使用您的注册账户登录“SUC”，有权自主选择的使用或不使用相关的服务。但您应对您的账户的全部行为承担责任，您的账户的行为均应被视为您的行为。
				</view>
				<view>
					您在使用“SUC”时，应遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，且保证在注册及使用“SUC”账号时，不得有以下情形：
				</view>
				<view>(1)违反宪法或法律法规规定的</view>
				<view>(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏囯家统一的；</view>
				<view>(3)损害国家宋誉和利益的，损害公共利益的</view>
				<view>(4)煽动民族仇恨、民族歧视，破坏民族团结的；</view>
				<view>(5)破坏国家宗教政策，宣扬邪教和封建迷信的；</view>
				<view>(6)散布谣言，扰乱社会秩序，破坏社会稳定的；</view>
				<view>(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</view>
				<view>(8)侮辱或者诽谤他人，侵害他人合法权益的</view>
				<view>(9)含有法律、行政法规禁上的其他内容或违反“SUC”的其他规定的。</view>
				<view class="underline">
					如您上传、发布或传输的内容含有以上违反法律法规的信息或内容的，或者侵犯任何第三方的合法权益，您将直接承担以上导致的一切不利后果。如因此给“SUC”造成不利后果的，您应负责消除影响，并且赔偿“SUC”因此导致的一切损失，包括且不限于财产损害赔偿、名誉损害赔偿、律师费、交通费等因维权而产生的合理费用。
				</view>
				<view>
					您应仔细阅读并遵守“SUC”在服务网站页面上公示的相应服务规则、操作规范、使用流程等内容，并准确理解相关内容及可能发生的后果，在使用服务过程中，您应依照相关操作指引进行操作，对于您违反相关操作指引所引起的后果由您自行承担，“SUC”不承担任何责任。
				</view>
				<view>2.“SUC”的权利及义务</view>
				<view>
					“SUC”将依照本协议的约定提供相应服务，并负责服务的日常维护及故障排除，
					<b class="underline">
						但因您的过错、不可抗力或非“SUC”可控的原因导致的故障，“SUC”不承担任何责任。
					</b>
				</view>
				<view>
					<b class="underline">
						为了提供服务质量或需要，“SUC”可根据实际情况，在需要时对服务进行升级和维护，在升级和维护期间，可能导致您的“SUC”服务暂时不可用，您同意“SUC”对此不承担任何责任。“SUC”在进行升级或维护时将提前发出公告或通知，请您应对“SUC”的升级和予以支持与配合。如您不配合“SUC”上述行为而导致的任何后果，由您承担全部责任。
					</b>
				</view>
			</view>
			<view class="con3">
				<h2>第八部分 通知及免责声明</h2>
				<view>1、通知</view>
				<view>您同意SUC以以下合理的方式向您送达各类通知：</view>
				<view>（一）站内公告；</view>
				<view>（二）站内消息、弹出消息、客户端推送的消息；</view>
				<view>（三）根据您预留于SUC平台的联系方式发出的电子邮件、手机短信等</view>
				<view>
					<b>
						SUC通过上述方式向您发出通知，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。
					</b>
				</view>
				<view>
					对于在SUC平台上因交易活动引起的任何纠纷，对于在SUC平台上因交易活动引起的任何纠纷，您应该及时与卖家或买家联系，如未能及时解决，请及时联系官方客服。
				</view>
			</view>
			<view class="con3">
				<h2>第九部分 版本升级</h2>
				<view>
					本软件将来是否提供升级版本由“SUC”自行决定。如果“SUC”提供本软件的升级版本，需强制进行升级，之前版本不可用。
					<b class="underline">
						您选择操作升级的动作即表示您已经明确“同意”遵守相关的“产品协议”，如您不同意“产品协议”的任何内容，请不要进行任何升级动作。
					</b>
				</view>
			</view>
		</view>
	</view>
</template>

<script>
export default {
	data() {
		return {
			statusBarHeight:0
		};
	},
	created() {
		uni.getSystemInfo({
			success: res => {
				this.statusBarHeight = res.statusBarHeight;
			}
		});
	},
	methods: {}
};
</script>

<style lang="scss">
.agreement-root {
	color: #f8f8f8;
	min-height: 100vh;
	background-color: #000;
	padding: 50rpx 30rpx;
	  .con1 {
	    font-size: 30rpx;
	    width: 100%;
	    h2 {
	      text-align: center;
	    }
	  }
	  b {
	    font-weight: bold;
	  }
	  view {
	    padding-top: 20rpx;
	    text-align: justify;
	    line-height: 50rpx;
	    text-indent: 2em;
	  }
	  .con2,
	  .con3 {
	    h2 {
	      margin-top: 38rpx;
	      font-size: 32rpx;
	      font-weight: bold;
	      padding-bottom: 10rpx;
	      text-align: center;
	    }
	    view {
	      font-size: 30rpx;
	      line-height: 42rpx;
	      text-indent: 2em;
	    }
	  }
}
</style>
